Курсы1/src/DataProcessors/ЗаказТовара/ЗаказТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаказТовара</name>
</mdclass:DataProcessor>

Курсы1/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ПродажаТовара</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Курсы1/src/DataProcessors/ЗаказТовара/Forms/Форма/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	
	
		
	ТЗ.Очистить();
	
	
	ЗапросНоменклатуры = Новый Запрос("ВЫБРАТЬ
	                                  |	РасходнаяНакладнаяНоменклатура.Номенклатура КАК Номенклатура,
	                                  |	СУММА(РасходнаяНакладнаяНоменклатура.Количество) КАК Количество
	                                  |ИЗ
	                                  |	Документ.РасходнаяНакладная.Номенклатура КАК РасходнаяНакладнаяНоменклатура
	                                  |ГДЕ
	                                  |	РасходнаяНакладнаяНоменклатура.Ссылка.Проведен
	                                  |	И РасходнаяНакладнаяНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	РасходнаяНакладнаяНоменклатура.Номенклатура
	                                  |
	                                  |ОБЪЕДИНИТЬ ВСЕ
	                                  |
	                                  |ВЫБРАТЬ
	                                  |	ПродажаУцененногоТовараНоменклатура.Номенклатура,
	                                  |	СУММА(ПродажаУцененногоТовараНоменклатура.Количество)
	                                  |ИЗ
	                                  |	Документ.ПродажаУцененногоТовара.Номенклатура КАК ПродажаУцененногоТовараНоменклатура
	                                  |ГДЕ
	                                  |	ПродажаУцененногоТовараНоменклатура.Ссылка.Проведен
	                                  |	И ПродажаУцененногоТовараНоменклатура.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	                                  |
	                                  |СГРУППИРОВАТЬ ПО
	                                  |	ПродажаУцененногоТовараНоменклатура.Номенклатура");
	
	ЗапросНоменклатуры.УстановитьПараметр("Дата1", Период.ДатаНачала);
	ЗапросНоменклатуры.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	
	
	ТаблицаНоменклатуры = ЗапросНоменклатуры.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Строка.Номенклатура;
		СтрокаТЗ.КоличествоПроданного = Строка.Количество;
		СтрокаТЗ.КоличествоДляЗаказа = Цел(Строка.Количество * Коэффициент);
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЗначениеЗаполнено(Коэффициент) ИЛИ НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Сообщить("Данные не заполнены");
		Возврат
	КонецЕсли;

	СформироватьНаСервере();
КонецПроцедуры
